Repository: artemmail/scriptor
Catalog: resources/bot.*.resx
Languages: ru

# CalendarAuthorizationRequired
source: 🔐 Connect Google Calendar in your profile: {0}
ru: 🔐 Подключите Google Calendar в профиле: {0}

# CalendarScenarioPrompt
source: ✅ Google Calendar is connected. Send a voice or text description of the event and I will add it to the calendar.
ru: ✅ Доступ к Google Calendar есть. Отправьте голосовое или текстовое описание события — добавлю встречу в календарь.

# CalendarTestEventSuccess
source: ✅ Test event created for {0}.
ru: ✅ Создал тестовое событие на {0}.

# CalendarTestEventFailure
source: ❌ Failed to create a test event: {0}
ru: ❌ Не удалось создать тестовое событие: {0}

# CalendarAuthorizationMissingDuringScenario
source: ⚠️ I cannot add the event because Google Calendar access is missing. Open your profile: {0}
ru: ⚠️ Не могу добавить событие: нет доступа к Google Calendar. Откройте профиль и подтвердите интеграцию: {0}

# TelegramIntegrationMisconfigured
source: ⚠️ Calendar integration is not configured. Update the integration token in your profile.
ru: ⚠️ Интеграция с календарём не настроена. Проверьте токен интеграции в настройках.

# CalendarScenarioConfirmation
source: 🗓 Event: "{0}". 📅 When: {1}. Add to calendar? Reply with Yes or No.
ru: 🗓 Событие: «{0}». 📅 Когда: {1}. Добавить в календарь? Ответьте «Да» или «Нет».

# CalendarScenarioNotRecognized
source: ⚠️ I didn't detect a calendar request. Please describe the meeting with date and time.
ru: ⚠️ Не распознал запрос на добавление в календарь. Пожалуйста, опишите встречу с датой и временем.

# CalendarScenarioMissingDate
source: ⚠️ I couldn't find the date and time. Please repeat with specific details.
ru: ⚠️ Не смог определить дату и время. Повторите, пожалуйста, с конкретными данными.

# CalendarScenarioCancelled
source: ❎ Got it, not adding the event.
ru: ❎ Хорошо, не добавляю событие.

# CalendarScenarioEventCreated
source: ✅ Created event "{0}" for {1}.
ru: ✅ Добавил событие «{0}» на {1}.

# CalendarScenarioEventFailed
source: ❌ Failed to create the event: {0}
ru: ❌ Не удалось создать событие: {0}
